-- migrate:up
INSERT INTO
    `locations` (id, location_name)
VALUES
    (1, '강남'), (2, '광화문'), (3, '교대'), (4, '구로'), (5, '명동'), (6, '삼성'), (7, '서울숲'), (8, '서초'), (9, '선릉'), (10, '선정릉'), (11, '성수'),
    (12, '시청'), (13, '신논현'), (14, '신사'), (15, '여의도'), (16, '역삼'), (17, '영등포'), (18, '용산'), (19, '을지로'), (20, '합정'), (21, '홍대');

INSERT INTO
    `fastfive_branches` (locations_id, branch_name)
VALUES
    (1, '강남1호점'), (1, '강남2호점'), (1, '강남3호점'), (1, '강남4호점'), (1, '강남5호점'), (2, '광화문점'), (3, '교대점'), (4, '구로1호점'), (5, '명동1호점'), (6, '삼성1호점'),
    (6, '삼성2호점'), (6, '삼성3호점'), (6, '삼성4호점'), (7, '서울숲점'), (8, '서초점'), (9, '선릉1호점'), (9, '선릉2호점'), (10, '선정릉역'), (11, '성수점'), (12, '시청1호점'),
    (12, '시청2호점'), (13, '신논현1호점'), (14, '신사점'), (15, '여의도점'), (16, '역삼1호점'), (16, '역삼2호점'), (16, '역삼3호점'), (16, '역삼4호점'), (17, '영등포점'),
    (18, '용산1호점'), (19, '을지로점'), (20, '합정점'), (21, '홍대1호점'), (21, '홍대2호점');

-- migrate:down
SET foreign_key_checks = 0;
TRUNCATE TABLE `fastfive_branches`;
TRUNCATE TABLE `locations`;
SET foreign_key_checks = 1;
